'''
вывод текста
выражения и операторы
переменные
условия
циклы
функции
последовательности
модули
ООП
'''

questions = [
    {
        'вопрос': 'Какой оператор умножает числа в Питоне?',
        'ответы': ['-', '+', '*', '**'],
        'индекс правильного ответа': 2,
        'теги': ('выражения и операторы'),
        'картинка': '100.png'
    },
    {
        'вопрос': 'Какой из этих типов изменяемый?',
        'ответы': ['list', 'str', 'tuple', 'int'],
        'индекс правильного ответа': 0,
        'теги': ('последовательности')
    },
    {
        'вопрос': 'Как прекратить цикл?',
        'ответы': ['break', 'stop', 'brek'],
        'индекс правильного ответа': 0,
        'теги': ('циклы')
    },
    {
        'вопрос': 'условия с помощью?',
        'ответы': ['if', 'ilif', 'yslovie', 'ef'],
        'индекс правильного ответа': 0,
        'теги': ('условия')
    },
    {
        'вопрос': 'Как создать бесконечный цикл?',
        'ответы': ['for', 'true While', 'while True'],
        'индекс правильного ответа': 3,
        'теги': ('циклы')
    },
    {
        'вопрос': 'Как в Пайтоне создать пустой список?',
        'ответы': ['my_list = [ ]', 'my_list = None', 'my_list = 0'],
        'индекс правильного ответа': 0,
        'теги': ('последовательности')
    },
    {
        'вопрос': 'Как определить функцию',
        'ответы': ['df', 'define', 'def'],
        'индекс правильного ответа': 2,
        'теги': ('функции')
    },
    {
        'вопрос': 'Какой из операторов используется для повторения строки в Python?',
        'ответы': ['-', '&', '*'],
        'индекс правильного ответа': 1,
        'теги': ('вывод текста')
    },
    {
        'вопрос': 'Что будет выведено на экран в результате: print("1234"[3])?',
        'ответы': ['ошибка', '1234', '4'],
        'индекс правильного ответа': 2,
        'теги': ('вывод текста')
    },
    {
        'вопрос': 'акой тип данных в Питоне представляет множества?',
        'ответы': ['list', 'dict', 'set'],
        'индекс правильного ответа': 2,
        'теги': ('последовательности')
    },
    ]
