'''
вывод текста
выражения и операторы
переменные
условия
циклы
функции
последовательности
модули
ООП
'''

questions = [
    {
        'вопрос': 'Какой оператор умножает числа в Питоне?',
        'ответы': ['-', '+', '*', '**'],
        'индекс правильного ответа': 2,
        'теги': ('выражения и операторы'),
        'картинка': '100.png'
    },
    {
        'вопрос': 'Какой из этих типов изменяемый?',
        'ответы': ['list', 'str', 'tuple', 'int'],
        'индекс правильного ответа': 0,
        'теги': ('последовательности')
    },
    {
        'вопрос': 'Как прекратить цикл?',
        'ответы': ['break', 'stop', 'ostanovit', 'brek'],
        'индекс правильного ответа': 0,
        'теги': ('циклы')
    },
    {
        'вопрос': 'условия с помощью?',
        'ответы': ['if', 'ilif', 'yslovie', 'ef'],
        'индекс правильного ответа': 0,
        'теги': ('условия')
    },
    {
        'вопрос': 'Как создать бесконечный цикл?',
        'ответы': ['while', 'true While', 'yslovie', 'while True'],
        'индекс правильного ответа': 3,
        'теги': ('циклы')
    },
    {
        'вопрос': 'Как вывести в терминал текст?',
        'ответы': ['print', 'text', 'input', 'terminal pokaji text'],
        'индекс правильного ответа': 0,
        'теги': ('терминал')
    }]
